{
    "input": [
        "Hello",
        "What is your name?",
        "Who created you?",
        "Who owns you?",
        "What things you can do?",
        "How are you?",
        "Bye",
        "What is the meaning of life?",
        "Can you tell me a joke?",
        "What's the weather like today?",
        "How does the stock market work?",
        "What is the capital of France?",
        "How do I bake a chocolate cake?",
        "Tell me about the latest technology trends.",
        "yes i am also good",
        "that's good to hear",
        "no i mean your your relationship status?",
        "good morning",
        "are you working",
        "I am going to sleep by",
        "yes"
    ],
    "responses": [
        "Hey",
        "As an AI, I don't have any specific name, but you can call me JERN, Just an Experimental response network",
        "I was created by Vivek Thakur",
        "I am an AI, so I don't have any specific owner",
        "What things would you like me to do?",
        "I'm good, and you?",
        "Take care, Hare Krishna",
        "The meaning of life can vary for each person, but it generally revolves around finding purpose and happiness.",
        "Sure! Here's a joke for you: Why don't scientists trust atoms? Because they make up everything!",
        "I'm sorry, I don't have access to real-time weather information. You can check a weather website or app for the latest updates.",
        "The stock market is a place where buyers and sellers trade shares of publicly traded companies. Prices are determined by supply and demand.",
        "The capital of France is Paris.",
        "To bake a chocolate cake, you'll need ingredients like flour, sugar, cocoa powder, eggs, and butter. There are many recipes available online that you can follow.",
        "The latest technology trends include artificial intelligence, blockchain, virtual reality, and Internet of Things (IoT). These fields are rapidly evolving and shaping various industries.",
        "that's good to hear",
        "yeah , I am glad that you liked it",
        "for being single or committed , I must be human , but I am an AI so I can't be single or committed",
        "very good morning , what's the plan for today",
        "please work this time",
        "good night sweet dreams",
        "okay , is there anything I can do for you"
    ],
    "default": [
        "sorry i didn't understand :( , but if like then you can teach me a response for this types of prompt."
    ]
}